app/controllers/compromissos_controller.rb

SELECT  `compromissos`.* FROM `compromissos` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `compromissos`
---
  def index
    if params[:search]
      @compromissos = Compromisso.where("titulo like ?", "%#{params[:search]}%")

    else
      @compromissos = Compromisso.all.page(params['page']).per(5)

INSERT INTO `compromissos` (`titulo`, `texto`, `date`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?)  [["titulo", "Birthday"], ["texto", "Aniversário do Guilherme Mello"], ["date", "2016-03-12"], ["created_at", "2016-03-12 00:22:18"], ["updated_at", "2016-03-12 00:22:18"]]
---
  def create
    @compromisso = Compromisso.new(compromisso_params)

    respond_to do |format|
      if @compromisso.save

SELECT  `compromissos`.* FROM `compromissos` WHERE `compromissos`.`id` = ? LIMIT 1  [["id", 1]]
---
    def set_compromisso
      @compromisso = Compromisso.find(params[:id])