app/controllers/disciplinas_controller.rb

SELECT `disciplinas`.* FROM `disciplinas` WHERE (nome like '%as%')
SELECT COUNT(*) FROM `disciplinas`
SELECT `disciplinas`.* FROM `disciplinas`
---
  def index
    if params[:search]
      @disciplinas = Disciplina.where("nome like ?", "%#{params[:search]}%")
      @disciplinas = @disciplinas.all.page(params['page']).per(10)

SELECT  `disciplinas`.* FROM `disciplinas` WHERE `disciplinas`.`id` = 1 LIMIT 1
---
    def set_disciplina
      @disciplina = Disciplina.find(params[:id])