app/controllers/estudios_controller.rb

  def index
    if params[:search]
      @estudios = Estudio.where("nome like ?", "%#{params[:search]}%")
    else
      #@estudios = Estudio.all
      @estudios = Estudio.all.page(params['page']).per(5)
---
SELECT  `estudios`.* FROM `estudios` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `estudios`

    def set_estudio
      @estudio = Estudio.find(params[:id])
---
SELECT  `estudios`.* FROM `estudios` WHERE `estudios`.`id` = 5 LIMIT 1