app/controllers/eventos_controller.rb

  def index
     if params[:search]
      @eventos = Evento.where("studio_id = ?", "%={params[:search]}%")

    else
     # @disciplinas = Disciplina.all
     @eventos = Evento.all.page(params['page']).per(5)
---
SELECT `eventos`.* FROM `eventos` WHERE (studio_id = '%={params[:search]}%')
SELECT  `eventos`.* FROM `eventos` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `eventos`

  def create
    @evento = Evento.new(evento_params)

    respond_to do |format|
      if @evento.save
---
INSERT INTO `eventos` (`disciplina_id`, `mestre_id`, `studio_id`, `data`, `hora_inicial`, `hora_final`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_evento
      @evento = Evento.find(params[:id])
---
SELECT  `eventos`.* FROM `eventos` WHERE `eventos`.`id` = ? LIMIT 1  [["id", 1]]