app/controllers/mestres_controller.rb

SELECT `mestres`.* FROM `mestres` WHERE (nome like'%Isa')
SELECT  `mestres`.* FROM `mestres` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `mestres`
---
  def index
    if params[:search]
      @mestres = Mestre.where("nome like ?", "%#{params[:search]}%")

    else
      # @mestres = Mestre.all
      @mestres = Mestre.all.page(params['page']).per(5)

INSERT INTO `mestres` (`nome`, `matricula`, `celular`, `email`, `foto`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @mestre = Mestre.new(mestre_params)

    respond_to do |format|
      if @mestre.save

UPDATE `mestres` SET `nome` = ?, `updated_at` = ? WHERE `mestres`.`id` = ?  [["nome", "José Amaro da Silva"], ["updated_at", "2016-03-16 10:29:36"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @mestre.update(mestre_params)

SELECT  `mestres`.* FROM `mestres` WHERE `mestres`.`id` = ? LIMIT 1  [["id", 1]]
---
    def set_mestre
      @mestre = Mestre.find(params[:id])