app/controllers/studios_controller.rb

SELECT `studios`.* FROM `studios` WHERE (nome like '%li%')
SELECT  `studios`.* FROM `studios` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `studios`
---
  def index
    if params[:search]
      @studios = Studio.where("nome like ?", "%#{params[:search]}%")
    else
      #@studios = Studio.all
      @studios = Studio.all.page(params['page']).per(5)

INSERT INTO `studios` (`nome`, `endereco`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?)  [["nome", "Herbert Reacher"], ["endereco", "Rua Conde de Bonfim,290 - Tijuca"], ["created_at", "2016-03-11 23:07:26"], ["updated_at", "2016-03-11 23:07:26"]]
---
  def create
    @studio = Studio.new(studio_params)

    respond_to do |format|
      if @studio.save

SELECT  `studios`.* FROM `studios` WHERE `studios`.`id` = ? LIMIT 1  [["id", 1]]
---
    def set_studio
      @studio = Studio.find(params[:id])